Revit 2027 API
DuctSettings.OvalDuctSizeSeparator Property
 The oval duct size separator string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OvalDuctSizeSeparator { get; set; }
Public Property OvalDuctSizeSeparator As String
	Get
	Set
public:
property String^ OvalDuctSizeSeparator {
	String^ get ();
	void set (String^ value);
}
member OvalDuctSizeSeparator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace